# DoubleParameterValue Properties

---
The DoubleParameterValue type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ParameterValue)
| Value|  The stored value
Top
#### Reference
DoubleParameterValue Class
Autodesk.Revit.DB Namespace